class ToastSvgLib {

  static const String SUCCESS = '''
  <?xml version="1.0" encoding="UTF-8"?>
  <svg width="70px" height="70px" viewBox="0 0 70 70" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
      <!-- Generator: Sketch 63.1 (92452) - https://sketch.com -->
      <title>check-circle</title>
      <desc>Created with Sketch.</desc>
      <g id="7.-操作反馈" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
          <g id="操作反馈" transform="translate(-2165.000000, -347.000000)" fill-rule="nonzero">
              <g id="弹框/成功提示备份" transform="translate(2080.000000, 288.000000)">
                  <g id="弹框/成功提示">
                      <g id="编组" transform="translate(28.000000, 54.000000)">
                          <g id="check-circle" transform="translate(52.000000, 0.000000)">
                              <rect id="矩形" fill="#000000" opacity="0" x="0" y="0" width="80" height="80"></rect>
                              <path d="M54.609375,27.578125 L50.9453125,27.578125 C50.1484375,27.578125 49.390625,27.9609375 48.921875,28.6171875 L36.640625,45.6484375 L31.078125,37.9296875 C30.609375,37.28125 29.859375,36.890625 29.0546875,36.890625 L25.390625,36.890625 C24.8828125,36.890625 24.5859375,37.46875 24.8828125,37.8828125 L34.6171875,51.3828125 C35.609375,52.765625 37.6640625,52.765625 38.65625,51.3828125 L55.109375,28.5703125 C55.4140625,28.15625 55.1171875,27.578125 54.609375,27.578125 Z" id="路径" fill="#FFFFFF"></path>
                              <path d="M40,5 C20.671875,5 5,20.671875 5,40 C5,59.328125 20.671875,75 40,75 C59.328125,75 75,59.328125 75,40 C75,20.671875 59.328125,5 40,5 Z M40,69.0625 C23.953125,69.0625 10.9375,56.046875 10.9375,40 C10.9375,23.953125 23.953125,10.9375 40,10.9375 C56.046875,10.9375 69.0625,23.953125 69.0625,40 C69.0625,56.046875 56.046875,69.0625 40,69.0625 Z" id="形状" fill="#FFFFFF"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </g>
  </svg>
  ''';

  static const String ERROR = '''
  <?xml version="1.0" encoding="UTF-8"?>
  <svg width="70px" height="71px" viewBox="0 0 70 71" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
      <!-- Generator: Sketch 63.1 (92452) - https://sketch.com -->
      <title>close-circle</title>
      <desc>Created with Sketch.</desc>
      <g id="7.-操作反馈" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
          <g id="操作反馈" transform="translate(-1205.000000, -347.000000)" fill-rule="nonzero">
              <g id="弹框/成功提示" transform="translate(1120.000000, 288.000000)">
                  <g id="弹框/错误提示">
                      <g id="编组" transform="translate(58.000000, 54.000000)">
                          <g id="close-circle" transform="translate(22.000000, 0.000000)">
                              <rect id="矩形" fill="#000000" opacity="0" x="0" y="0" width="80" height="80"></rect>
                              <path d="M53.546875,27.71875 C53.546875,27.375 53.265625,27.09375 52.921875,27.09375 L47.765625,27.1171875 L40,36.375 L32.2421875,27.125 L27.078125,27.1015625 C26.734375,27.1015625 26.453125,27.375 26.453125,27.7265625 C26.453125,27.875 26.5078125,28.015625 26.6015625,28.1328125 L36.765625,40.2421875 L26.6015625,52.34375 C26.5078125,52.4609375 26.453125,52.6015625 26.453125,52.75 C26.453125,53.09375 26.734375,53.375 27.078125,53.375 L32.2421875,53.3515625 L40,44.09375 L47.7578125,53.34375 L52.9140625,53.3671875 C53.2578125,53.3671875 53.5390625,53.09375 53.5390625,52.7421875 C53.5390625,52.59375 53.484375,52.453125 53.390625,52.3359375 L43.2421875,40.234375 L53.40625,28.125 C53.5,28.015625 53.546875,27.8671875 53.546875,27.71875 Z" id="路径" fill="#FFFFFF"></path>
                              <path d="M40,5.078125 C20.671875,5.078125 5,20.75 5,40.078125 C5,59.40625 20.671875,75.078125 40,75.078125 C59.328125,75.078125 75,59.40625 75,40.078125 C75,20.75 59.328125,5.078125 40,5.078125 Z M40,69.140625 C23.953125,69.140625 10.9375,56.125 10.9375,40.078125 C10.9375,24.03125 23.953125,11.015625 40,11.015625 C56.046875,11.015625 69.0625,24.03125 69.0625,40.078125 C69.0625,56.125 56.046875,69.140625 40,69.140625 Z" id="形状" fill="#FFFFFF"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </g>
  </svg>
  ''';

  static const String WARNING = '''
  <?xml version="1.0" encoding="UTF-8"?>
  <svg width="70px" height="70px" viewBox="0 0 70 70" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
      <!-- Generator: Sketch 63.1 (92452) - https://sketch.com -->
      <title>warning-circle</title>
      <desc>Created with Sketch.</desc>
      <g id="7.-操作反馈" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
          <g id="操作反馈" transform="translate(-1525.000000, -347.000000)" fill-rule="nonzero">
              <g id="弹框/成功提示" transform="translate(1440.000000, 288.000000)">
                  <g id="弹框/警告提示">
                      <g id="编组" transform="translate(58.000000, 54.000000)">
                          <g id="warning-circle" transform="translate(22.000000, 0.000000)">
                              <rect id="矩形" fill="#000000" opacity="0" x="0" y="0" width="80" height="80"></rect>
                              <path d="M40,5 C20.671875,5 5,20.671875 5,40 C5,59.328125 20.671875,75 40,75 C59.328125,75 75,59.328125 75,40 C75,20.671875 59.328125,5 40,5 Z M40,69.0625 C23.953125,69.0625 10.9375,56.046875 10.9375,40 C10.9375,23.953125 23.953125,10.9375 40,10.9375 C56.046875,10.9375 69.0625,23.953125 69.0625,40 C69.0625,56.046875 56.046875,69.0625 40,69.0625 Z" id="形状" fill="#FFFFFF"></path>
                              <path d="M36.25,53.75 C36.25,55.8210678 37.9289322,57.5 40,57.5 C42.0710678,57.5 43.75,55.8210678 43.75,53.75 C43.75,51.6789322 42.0710678,50 40,50 C37.9289322,50 36.25,51.6789322 36.25,53.75 Z" id="路径" fill="#FFFFFF"></path>
                              <path d="M38.125,45 L41.875,45 C42.21875,45 42.5,44.71875 42.5,44.375 L42.5,23.125 C42.5,22.78125 42.21875,22.5 41.875,22.5 L38.125,22.5 C37.78125,22.5 37.5,22.78125 37.5,23.125 L37.5,44.375 C37.5,44.71875 37.78125,45 38.125,45 Z" id="路径" fill="#FFFFFF"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </g>
  </svg>
  ''';
}